{
  "name": "Home Assistant",
  "longDescription": "<p>Home Assistant is an open-source home automation platform focused on privacy and local control. It allows you to control all your devices from a single, unified interface. It is powered by a worldwide community of tinkerers and DIY enthusiasts, perfect to run on a Raspberry Pi or a local server.</p><p>Home Assistant integrates with a large number of different devices and services, providing the user with a powerful and flexible home automation control center. In addition to its powerful, flexible features, it provides advanced automation capabilities to help make your life easier.</p><p>With support for a vast array of devices and services, Home Assistant can be the one-stop solution for all your home automation needs. Get started with Home Assistant today and take control of your home automation!</p>",
  "description": "Home Assistant is an open-source home automation platform that focuses on privacy and local control. It allows you to control all your devices from a single interface, integrating with a large number of devices and services. Home Assistant offers advanced automation capabilities, running perfectly on a Raspberry Pi or a local server. Start using Home Assistant today for a comprehensive home automation solution.",
  "translation": {
    "de": {
      "description": "Home Assistant ist eine Open-Source-Plattform für die Heimautomatisierung, die sich auf Datenschutz und lokale Kontrolle konzentriert. Sie ermöglicht es Ihnen, alle Ihre Geräte über eine einzige Schnittstelle zu steuern, die mit einer großen Anzahl von Geräten und Diensten integriert werden kann. Home Assistant bietet fortschrittliche Automatisierungsfunktionen und läuft perfekt auf einem Raspberry Pi oder einem lokalen Server. Nutzen Sie Home Assistant noch heute für eine umfassende Heimautomatisierungslösung.",
      "longDescription": "<p>Home Assistant ist eine Open-Source-Plattform für die Heimautomatisierung mit Schwerpunkt auf Datenschutz und lokaler Kontrolle. Es ermöglicht Ihnen, alle Ihre Geräte über eine einzige, einheitliche Schnittstelle zu steuern. Er wird von einer weltweiten Gemeinschaft von Bastlern und Heimwerkern betrieben und eignet sich perfekt für den Betrieb auf einem Raspberry Pi oder einem lokalen Server</p><p>Home Assistant lässt sich in eine Vielzahl von Geräten und Diensten integrieren und bietet dem Benutzer eine leistungsstarke und flexible Steuerzentrale für die Hausautomation. Zusätzlich zu seinen leistungsstarken und flexiblen Funktionen bietet er fortschrittliche Automatisierungsmöglichkeiten, die Ihnen das Leben leichter machen.</p><p>Home Assistant unterstützt eine Vielzahl von Geräten und Diensten und ist damit die Komplettlösung für alle Ihre Bedürfnisse im Bereich der Hausautomation. Starten Sie noch heute mit Home Assistant und übernehmen Sie die Kontrolle über Ihre Heimautomation!</p>"
    },
    "de-CH": {
      "description": "Home Assistant ist eine Open-Source-Plattform für die Heimautomatisierung, die sich auf Datenschutz und lokale Kontrolle konzentriert. Sie ermöglicht es Ihnen, alle Ihre Geräte über eine einzige Schnittstelle zu steuern, die mit einer grossen Anzahl von Geräten und Diensten integriert werden kann. Home Assistant bietet fortschrittliche Automatisierungsfunktionen und läuft perfekt auf einem Raspberry Pi oder einem lokalen Server. Nutzen Sie Home Assistant noch heute für eine umfassende Heimautomatisierungslösung.",
      "longDescription": "<p>Home Assistant ist eine Open-Source-Plattform für die Heimautomatisierung mit Schwerpunkt auf Datenschutz und lokaler Kontrolle. Es ermöglicht Ihnen, alle Ihre Geräte über eine einzige, einheitliche Schnittstelle zu steuern. Er wird von einer weltweiten Gemeinschaft von Bastlern und Heimwerkern betrieben und eignet sich perfekt für den Betrieb auf einem Raspberry Pi oder einem lokalen Server</p><p>Home Assistant lässt sich in eine Vielzahl von Geräten und Diensten integrieren und bietet dem Benutzer eine leistungsstarke und flexible Steuerzentrale für die Hausautomation. Zusätzlich zu seinen leistungsstarken und flexiblen Funktionen bietet er fortschrittliche Automatisierungsmöglichkeiten, die Ihnen das Leben leichter machen.</p><p>Home Assistant unterstützt eine Vielzahl von Geräten und Diensten und ist damit die Komplettlösung für alle Ihre Bedürfnisse im Bereich der Hausautomation. Starten Sie noch heute mit Home Assistant und übernehmen Sie die Kontrolle über Ihre Heimautomation!</p>"
    }
  },
  "tags": ["smart home",  "home automation", "IoT", "Raspberry Pi", "local server", "privacy", "control", "automation", "devices", "services", "home assistant"],
  "repository": "https://github.com/home-assistant/core",
  "image": "https://hub.docker.com/r/homeassistant/home-assistant",
  "supported_architectures": ["amd64", "arm64"]
}
