{
  "name": "Home Assistant",
  "description": "Open-source home automation platform that focuses on privacy and local control. Visualize, Control and Automate 2800+ Systems from one Interface",
  "longDescription": "<p>Home Assistant is an open-source home automation platform focused on privacy and local control. It allows you to control all your devices from a single, unified interface. It is powered by a worldwide community of tinkerers and DIY enthusiasts, perfect to run on a Raspberry Pi or a local server.</p><p>Home Assistant integrates with a large number of different devices and services, providing the user with a powerful and flexible home automation control center. In addition to its powerful, flexible features, it provides advanced automation capabilities to help make your life easier.</p><p>With support for a vast array of devices and services, Home Assistant can be the one-stop solution for all your home automation needs. Get started with Home Assistant today and take control of your home automation!</p>",
  "translation": {
    "de": {
      "description": "Open-Source Smarthome-Plattform mit Schwerpunkt auf Datenschutz und lokale Kontrolle. Visualisieren, Steuern und Automatisieren Sie mehr als 2800 Systeme über eine einzige Visualisierung.",
      "longDescription": "<p>Home Assistant ist eine Open-Source-Plattform für die Heimautomatisierung mit Schwerpunkt auf Datenschutz und lokaler Kontrolle. Es ermöglicht Ihnen, alle Ihre Geräte über eine einzige, einheitliche Schnittstelle zu steuern. Er wird von einer weltweiten Gemeinschaft von Bastlern und Heimwerkern betrieben und eignet sich perfekt für den Betrieb auf einem Raspberry Pi oder einem lokalen Server</p><p>Home Assistant lässt sich in eine Vielzahl von Geräten und Diensten integrieren und bietet dem Benutzer eine leistungsstarke und flexible Steuerzentrale für die Hausautomation. Zusätzlich zu seinen leistungsstarken und flexiblen Funktionen bietet er fortschrittliche Automatisierungsmöglichkeiten, die Ihnen das Leben leichter machen.</p><p>Home Assistant unterstützt eine Vielzahl von Geräten und Diensten und ist damit die Komplettlösung für alle Ihre Bedürfnisse im Bereich der Hausautomation. Starten Sie noch heute mit Home Assistant und übernehmen Sie die Kontrolle über Ihre Heimautomation!</p>"
    },
    "fr": {
      "longDescription": "<p>Home Assistant est une plateforme open source de domotique axée sur la confidentialité et le contrôle local. Elle vous permet de contrôler tous vos appareils à partir d'une interface unique et unifiée. Elle est alimentée par une communauté mondiale de bricoleurs et de passionnés de DIY, et fonctionne parfaitement sur un Raspberry Pi ou un serveur local. </p><p>Home Assistant s'intègre à un grand nombre d'appareils et de services différents, offrant à l'utilisateur un centre de contrôle domotique puissant et flexible. En plus de ses fonctionnalités puissantes et flexibles, elle offre des capacités d'automatisation avancées pour vous faciliter la vie. </p><p>Grâce à la prise en charge d'une vaste gamme d'appareils et de services, Home Assistant peut être la solution unique pour tous vos besoins en matière de domotique. Commencez dès aujourd'hui à utiliser Home Assistant et prenez le contrôle de votre domotique !</p>",
      "description": "Plateforme domotique open source axée sur la confidentialité et le contrôle local. Visualisez, contrôlez et automatisez plus de 2 800 systèmes à partir d'une seule interface."
    },
    "it": {
      "longDescription": "<p>Home Assistant è una piattaforma open source per la domotica incentrata sulla privacy e sul controllo locale. Consente di controllare tutti i dispositivi da un'unica interfaccia unificata. È alimentata da una comunità mondiale di appassionati di fai da te e di tecnologia, perfetta per funzionare su un Raspberry Pi o su un server locale. </p><p>Home Assistant si integra con un gran numero di dispositivi e servizi diversi, fornendo all'utente un centro di controllo domotico potente e flessibile. Oltre alle sue potenti e flessibili funzionalità, offre capacità di automazione avanzate per semplificare la vita. Grazie al supporto di una vasta gamma di dispositivi e servizi, Home Assistant può essere la soluzione completa per tutte le esigenze di automazione domestica. Inizia oggi stesso a utilizzare Home Assistant e prendi il controllo della tua automazione domestica!</p>",
      "description": "Piattaforma open source per la domotica incentrata sulla privacy e sul controllo locale. Visualizza, controlla e automatizza oltre 2800 sistemi da un'unica interfaccia."
    }
  },
  "tags": ["smart home",  "home automation", "IoT", "Raspberry Pi", "local server", "privacy", "control", "automation", "devices", "services", "home assistant"],
  "repository": "https://github.com/home-assistant/core",
  "image": "https://hub.docker.com/r/homeassistant/home-assistant",
  "supported_architectures": ["amd64", "arm64"]
}
