{
  "name": "Code-Server",
  "longDescription": "<p>Code-Server is an open-source project that allows developers to run Visual Studio Code, a popular development environment, on any machine remotely. This makes it possible to code on your cloud server, which can be particularly beneficial when dealing with large datasets, complex computations, or restricted local resources.</p><p>Key features of Code-Server include full Visual Studio Code experience, secure access over SSH or HTTPS, and compatibility with VS Code extensions. It is also designed to be easy to install and get up and running.</p><p>Code-Server is available on various platforms including Windows, Linux, and MacOS, and it supports Docker, making it a highly versatile tool for developers across different environments.</p>",
  "description": "Code-Server is an open-source tool that enables running Visual Studio Code on a remote server. It provides a full VS Code experience, secure remote access, and compatibility with VS Code extensions. Code-Server is compatible with Windows, Linux, MacOS, and Docker.",
  "translation": {
    "de": {
      "longDescription": "<p>Code-Server ist ein Open-Source-Projekt, das es Entwicklern ermöglicht, Visual Studio Code, eine beliebte Entwicklungsumgebung, auf einem beliebigen Rechner aus der Ferne auszuführen. Dies macht es möglich, auf Ihrem Cloud-Server zu programmieren, was besonders vorteilhaft sein kann, wenn Sie mit großen Datensätzen, komplexen Berechnungen oder eingeschränkten lokalen Ressourcen zu tun haben.</p><p>Zu den wichtigsten Funktionen von Code-Server gehören die vollständige Visual Studio Code-Erfahrung, der sichere Zugriff über SSH oder HTTPS und die Kompatibilität mit VS Code-Erweiterungen. Code-Server ist auf verschiedenen Plattformen verfügbar, darunter Windows, Linux und MacOS, und unterstützt Docker, was es zu einem äußerst vielseitigen Tool für Entwickler in unterschiedlichen Umgebungen macht.</p>",
      "description": "Code-Server ist ein Open-Source-Tool, das die Ausführung von Visual Studio Code auf einem Remote-Server ermöglicht. Es bietet ein vollständiges VS Code-Erlebnis, sicheren Fernzugriff und Kompatibilität mit VS Code-Erweiterungen. Code-Server ist mit Windows, Linux, MacOS und Docker kompatibel."
    },
    "fr": {
      "longDescription": "<p>Code-Server est un projet open source qui permet aux développeurs d'exécuter Visual Studio Code, un environnement de développement populaire, à distance sur n'importe quelle machine. Cela permet de coder sur votre serveur cloud, ce qui peut être particulièrement avantageux lorsque vous traitez des ensembles de données volumineux, des calculs complexes ou des ressources locales limitées. </p><p>Les principales fonctionnalités de Code-Server comprennent une expérience Visual Studio Code complète, un accès sécurisé via SSH ou HTTPS et la compatibilité avec les extensions VS Code. Il est également conçu pour être facile à installer et à mettre en œuvre. </p><p>Code-Server est disponible sur diverses plateformes, notamment Windows, Linux et MacOS, et prend en charge Docker, ce qui en fait un outil très polyvalent pour les développeurs dans différents environnements.</p>",
      "description": "Code-Server est un outil open source qui permet d'exécuter Visual Studio Code sur un serveur distant. Il offre une expérience VS Code complète, un accès distant sécurisé et une compatibilité avec les extensions VS Code. Code-Server est compatible avec Windows, Linux, MacOS et Docker."
    },
    "it": {
      "longDescription": "<p>Code-Server è un progetto open source che consente agli sviluppatori di eseguire Visual Studio Code, un popolare ambiente di sviluppo, su qualsiasi macchina in remoto. Ciò rende possibile programmare sul proprio server cloud, il che può essere particolarmente vantaggioso quando si ha a che fare con grandi set di dati, calcoli complessi o risorse locali limitate. </p><p>Le caratteristiche principali di Code-Server includono l'esperienza completa di Visual Studio Code, l'accesso sicuro tramite SSH o HTTPS e la compatibilità con le estensioni VS Code. È inoltre progettato per essere facile da installare e mettere in funzione. </p><p>Code-Server è disponibile su varie piattaforme, tra cui Windows, Linux e MacOS, e supporta Docker, rendendolo uno strumento altamente versatile per gli sviluppatori in diversi ambienti.</p>",
      "description": "Code-Server è uno strumento open source che consente di eseguire Visual Studio Code su un server remoto. Offre un'esperienza VS Code completa, accesso remoto sicuro e compatibilità con le estensioni VS Code. Code-Server è compatibile con Windows, Linux, MacOS e Docker."
    }
  },
  "tags": ["development", "visual studio code", "code-server", "open-source", "cross-platform", "VS Code", "development environment", "remote coding", "SSH", "HTTPS", "windows", "linux", "macos", "docker"],
  "repository": "https://github.com/cdr/code-server",
  "image": "https://hub.docker.com/r/codercom/code-server",
  "supported_architectures": ["amd64", "arm64"]
}
