{
  "name": "Filebrowser",
  "longDescription": "<p>Filebrowser is an open-source, self-hosted web application for managing files within your server's file system. The application provides a user-friendly interface, making it simple to navigate, upload, download, and manage your files.</p><p>Key features of Filebrowser include support for custom commands, user and permissions management, shareable links, and a built-in text editor. It also supports various media file previews, including video and image file formats.</p><p>Filebrowser is designed to run on any platform that supports Go, including various Linux distributions, Windows, and MacOS. Additionally, it can be easily deployed using Docker.</p>",
  "description": "Filebrowser is an open-source, self-hosted web application for managing files within your server. It offers features like custom commands, user and permissions management, shareable links, built-in text editor, and media file previews. Filebrowser can be run on any platform that supports Go, including various Linux distributions, Windows, MacOS, and Docker.",
  "translation": {
    "de": {
      "description": "Filebrowser ist eine quelloffene, selbst gehostete Webanwendung zur Verwaltung von Dateien auf Ihrem Server. Sie bietet Funktionen wie benutzerdefinierte Befehle, Benutzer- und Berechtigungsverwaltung, gemeinsam nutzbare Links, einen integrierten Texteditor und eine Vorschau für Mediendateien. Filebrowser kann auf jeder Plattform ausgeführt werden, die Go unterstützt, einschließlich verschiedener Linux-Distributionen, Windows, MacOS und Docker.",
      "longDescription": "<p>Filebrowser ist eine quelloffene, selbst gehostete Webanwendung zur Verwaltung von Dateien im Dateisystem Ihres Servers. Die Anwendung bietet eine benutzerfreundliche Oberfläche, die das Navigieren, Hochladen, Herunterladen und Verwalten Ihrer Dateien vereinfacht.</p><p>Zu den wichtigsten Funktionen von Filebrowser gehören die Unterstützung für benutzerdefinierte Befehle, Benutzer- und Rechteverwaltung, gemeinsam nutzbare Links und ein integrierter Texteditor. Filebrowser ist so konzipiert, dass es auf jeder Plattform läuft, die Go unterstützt, einschließlich verschiedener Linux-Distributionen, Windows und MacOS. Außerdem kann er einfach mit Docker bereitgestellt werden.</p>"
    },
    "fr": {
      "longDescription": "<p>Filebrowser est une application web open source et auto-hébergée permettant de gérer les fichiers au sein du système de fichiers de votre serveur. L'application offre une interface conviviale qui facilite la navigation, le téléchargement et la gestion de vos fichiers. </p><p>Les principales fonctionnalités de Filebrowser comprennent la prise en charge des commandes personnalisées, la gestion des utilisateurs et des autorisations, les liens partageables et un éditeur de texte intégré. Il prend également en charge la prévisualisation de divers fichiers multimédias, y compris les formats de fichiers vidéo et image. </p><p>Filebrowser est conçu pour fonctionner sur toute plateforme prenant en charge Go, y compris diverses distributions Linux, Windows et MacOS. De plus, il peut être facilement déployé à l'aide de Docker.</p>",
      "description": "Filebrowser est une application web open source et auto-hébergée permettant de gérer les fichiers sur votre serveur. Elle offre des fonctionnalités telles que des commandes personnalisées, la gestion des utilisateurs et des autorisations, des liens partageables, un éditeur de texte intégré et des aperçus de fichiers multimédias. Filebrowser peut être exécuté sur n'importe quelle plateforme prenant en charge Go, y compris diverses distributions Linux, Windows, MacOS et Docker."
    },
    "it": {
      "longDescription": "<p>Filebrowser è un'applicazione web open source e self-hosted per la gestione dei file all'interno del file system del tuo server. L'applicazione offre un'interfaccia intuitiva che semplifica la navigazione, il caricamento, il download e la gestione dei tuoi file. </p><p>Le caratteristiche principali di Filebrowser includono il supporto per comandi personalizzati, la gestione degli utenti e delle autorizzazioni, i link condivisibili e un editor di testo integrato. Supporta anche l'anteprima di vari file multimediali, inclusi i formati video e immagine. </p><p>Filebrowser è progettato per funzionare su qualsiasi piattaforma che supporti Go, incluse varie distribuzioni Linux, Windows e MacOS. Inoltre, può essere facilmente implementato utilizzando Docker.</p>",
      "description": "Filebrowser è un'applicazione web open source e self-hosted per la gestione dei file all'interno del proprio server. Offre funzionalità quali comandi personalizzati, gestione degli utenti e delle autorizzazioni, link condivisibili, editor di testo integrato e anteprime dei file multimediali. Filebrowser può essere eseguito su qualsiasi piattaforma che supporti Go, incluse varie distribuzioni Linux, Windows, MacOS e Docker."
    }
  },
  "tags": ["filebrowser", "open-source", "self-hosted", "file management", "custom commands", "permissions management", "shareable links", "text editor", "media previews", "go", "linux", "windows", "macos", "docker"],
  "repository": "https://github.com/filebrowser/filebrowser",
  "image": "https://hub.docker.com/r/filebrowser/filebrowser",
  "supported_architectures": ["amd64", "arm64"]
}
