{
  "name": "EMQX",
  "longDescription": "<p>EMQX is the world's most scalable open-source MQTT broker with a high performance that connects 100M+ IoT devices in 1 cluster, while maintaining 1M message per second throughput and sub-millisecond latency.</p><p>EMQX supports multiple open standard protocols like MQTT, HTTP, QUIC, and WebSocket. It's 100% compliant with MQTT 5.0 and 3.x standard, and secures bi-directional communication with MQTT over TLS/SSL and various authentication mechanisms.</p><p>With the built-in powerful SQL-based rules engine, EMQX can extract, filter, enrich and transform IoT data in real-time. In addition, it ensures high availability and horizontal scalability with a masterless distributed architecture, and provides ops-friendly user experience and great observability.</p> <p>EMQX boasts more than 20K+ enterprise users across 50+ countries and regions, connecting 100M+ IoT devices worldwide, and is trusted by over 400 customers in mission-critical scenarios of IoT, IIoT, connected vehicles, and more, including over 70 Fortune 500 companies like HPE, VMware, Verifone, SAIC Volkswagen, and Ericsson.</p> <p>Default Login : admin/public </p>",
  "description": "The most scalable open-source MQTT broker for IoT, IIoT, connected vehicles, and more.",
  "translation": {
    "de": {
      "longDescription": "<p>EMQX ist der weltweit skalierbarste Open-Source-MQTT-Broker mit hoher Leistung, der mehr als 100 Millionen IoT-Geräte in einem Cluster verbindet und dabei einen Durchsatz von 1 Million Nachrichten pro Sekunde und eine Latenz von weniger als einer Millisekunde aufrechterhält. </p><p>EMQX unterstützt mehrere offene Standardprotokolle wie MQTT, HTTP, QUIC und WebSocket. Es ist zu 100 % kompatibel mit den Standards MQTT 5.0 und 3.x und sichert die bidirektionale Kommunikation mit MQTT über TLS/SSL und verschiedene Authentifizierungsmechanismen. </p><p>Mit der integrierten leistungsstarken SQL-basierten Regel-Engine kann EMQX IoT-Daten in Echtzeit extrahieren, filtern, anreichern und transformieren. Darüber hinaus gewährleistet es mit einer masterlosen verteilten Architektur eine hohe Verfügbarkeit und horizontale Skalierbarkeit und bietet eine benutzerfreundliche Bedienung und hervorragende Beobachtbarkeit. </p> <p>EMQX hat mehr als 20.000 Unternehmensnutzer in über 50 Ländern und Regionen, verbindet weltweit mehr als 100 Millionen IoT-Geräte und genießt das Vertrauen von über 400 Kunden in unternehmenskritischen Szenarien von IoT, IIoT, vernetzten Fahrzeugen und mehr, darunter über 70 Fortune-500-Unternehmen wie HPE, VMware, Verifone, SAIC Volkswagen und Ericsson. </p> <p>Standard-Login: admin/public </p>",
      "description": "Der skalierbarste Open-Source-MQTT-Broker für IoT, IIoT, vernetzte Fahrzeuge und mehr."
    },
    "fr": {
      "longDescription": "<p>EMQX est le courtier MQTT open source le plus évolutif au monde, avec des performances élevées qui permettent de connecter plus de 100 millions d'appareils IoT dans un seul cluster, tout en maintenant un débit de 1 million de messages par seconde et une latence inférieure à la milliseconde. </p><p>EMQX prend en charge plusieurs protocoles ouverts standard tels que MQTT, HTTP, QUIC et WebSocket. Il est 100 % conforme aux normes MQTT 5.0 et 3.x et sécurise la communication bidirectionnelle avec MQTT via TLS/SSL et divers mécanismes d'authentification. </p><p>Grâce à son puissant moteur de règles SQL intégré, EMQX peut extraire, filtrer, enrichir et transformer les données IoT en temps réel. De plus, il garantit une haute disponibilité et une évolutivité horizontale grâce à une architecture distribuée sans maître, et offre une expérience utilisateur conviviale et une excellente observabilité. </p> <p>EMQX compte plus de 20 000 utilisateurs professionnels dans plus de 50 pays et régions, connectant plus de 100 millions d'appareils IoT dans le monde entier. Il bénéficie de la confiance de plus de 400 clients dans des scénarios critiques tels que l'IoT, l'IIoT, les véhicules connectés, etc., dont plus de 70 entreprises du classement Fortune 500 telles que HPE, VMware, Verifone, SAIC Volkswagen et Ericsson. </p> <p>Connexion par défaut : admin/public </p>",
      "description": "Le courtier MQTT open source le plus évolutif pour l'IoT, l'IIoT, les véhicules connectés et bien plus encore."
    },
    "it": {
      "longDescription": "<p>EMQX è il broker MQTT open source più scalabile al mondo con prestazioni elevate che collega oltre 100 milioni di dispositivi IoT in un unico cluster, mantenendo una velocità di trasmissione di 1 milione di messaggi al secondo e una latenza inferiore al millisecondo. </p><p>EMQX supporta diversi protocolli standard aperti come MQTT, HTTP, QUIC e WebSocket. È conforme al 100% agli standard MQTT 5.0 e 3.x e garantisce una comunicazione bidirezionale con MQTT su TLS/SSL e vari meccanismi di autenticazione. </p><p>Grazie al potente motore di regole basato su SQL integrato, EMQX è in grado di estrarre, filtrare, arricchire e trasformare i dati IoT in tempo reale. Inoltre, garantisce un'elevata disponibilità e scalabilità orizzontale con un'architettura distribuita senza master e offre un'esperienza utente intuitiva e un'ottima osservabilità. </p> <p>EMQX vanta oltre 20.000 utenti aziendali in più di 50 paesi e regioni, connette oltre 100 milioni di dispositivi IoT in tutto il mondo ed è scelto da oltre 400 clienti in scenari mission-critical di IoT, IIoT, veicoli connessi e altro ancora, tra cui oltre 70 aziende Fortune 500 come HPE, VMware, Verifone, SAIC Volkswagen ed Ericsson. </p> <p>Accesso predefinito: admin/public </p>",
      "description": "Il broker MQTT open source più scalabile per IoT, IIoT, veicoli connessi e altro ancora."
    }
  },
  "tags": [ "mqtt","emqx","iot","home assistant","smart home",  "home automation"],
  "repository": "https://github.com/emqx/emqx",
  "image": "https://hub.docker.com/_/emqx",
  "supported_architectures": ["amd64", "arm64"]
}