{
  "name": "Grafana",
  "description": "A complete observability stack that allows you to monitor and analyze metrics, logs and traces. It allows you to query, visualize, alert on and understand your data no matter where it is stored.",
  "longDescription": "Grafana open source is open source visualization and analytics software.<br />Visualizations: Fast and flexible client side graphs with a multitude of options. Panel plugins offer many different ways to visualize metrics and logs.<br />Dynamic Dashboards: Create dynamic & reusable dashboards with template variables that appear as dropdowns at the top of the dashboard.<br />Explore Metrics: Explore your data through ad-hoc queries and dynamic drilldown. Split view and compare different time ranges, queries and data sources side by side.<br />Explore Logs: Experience the magic of switching from metrics to logs with preserved label filters. Quickly search through all your logs or streaming them live.<br />Alerting: Visually define alert rules for your most important metrics. Grafana will continuously evaluate and send notifications to systems like Slack, PagerDuty, VictorOps, OpsGenie.<br />Mixed Data Sources: Mix different data sources in the same graph! You can specify a data source on a per-query basis. This works for even custom datasources.",
  "translation": {
    "de": {
      "description": "Ein vollständiger Monitoring-Stack, mit dem Sie Metriken, Protokolle und Traces überwachen und analysieren können. Es ermöglicht Ihnen, Ihre Daten abzufragen, zu visualisieren, zu alarmieren und zu verstehen, unabhängig davon, wo sie gespeichert sind.",
      "longDescription": "<p>Grafana open source ist eine quelloffene Visualisierungs- und Analysesoftware.</p><p>Visualisierungen: Schnelle und flexible clientseitige Diagramme mit einer Vielzahl von Optionen. Panel-Plugins bieten viele verschiedene Möglichkeiten zur Visualisierung von Metriken und Protokollen.</p><p>Dynamische Dashboards: Erstellen Sie dynamische und wiederverwendbare Dashboards mit Template-Variablen, die als Dropdowns am oberen Rand des Dashboards erscheinen.</p><p>Erforschen Sie Metriken: Erforschen Sie Ihre Daten durch Ad-hoc-Abfragen und dynamische Drilldowns. Teilen Sie die Ansicht und vergleichen Sie verschiedene Zeitbereiche, Abfragen und Datenquellen nebeneinander.</p><p>Erforschen Sie Logs: Erleben Sie die Magie des Wechsels von Metriken zu Protokollen mit erhaltenen Etikettenfiltern. Durchsuchen Sie schnell alle Ihre Protokolle oder streamen Sie sie live.</p><p>Benachrichtigung: Definieren Sie visuell Warnregeln für Ihre wichtigsten Metriken. Grafana wertet kontinuierlich aus und sendet Benachrichtigungen an Systeme wie Slack, PagerDuty, VictorOps, OpsGenie.</p><p>Mixed Data Sources: Mischen Sie verschiedene Datenquellen im selben Diagramm! Sie können eine Datenquelle pro Abfrage festlegen. Dies funktioniert sogar für benutzerdefinierte Datenquellen.</p>"
    },
    "fr": {
      "longDescription": "Grafana open source est un logiciel open source de visualisation et d'analyse. <br />Visualisations : graphiques côté client rapides et flexibles avec une multitude d'options. Les plugins de panneau offrent de nombreuses façons différentes de visualiser les métriques et les journaux. <br />Tableaux de bord dynamiques : créez des tableaux de bord dynamiques et réutilisables avec des variables de modèle qui apparaissent sous forme de menus déroulants en haut du tableau de bord. <br />Explorez les métriques : explorez vos données grâce à des requêtes ad hoc et des analyses dynamiques. Divisez la vue et comparez différentes plages de temps, requêtes et sources de données côte à côte. <br />Explorez les journaux : découvrez la magie du passage des métriques aux journaux avec des filtres d'étiquettes préservés. Effectuez rapidement des recherches dans tous vos journaux ou diffusez-les en direct. <br />Alertes : définissez visuellement des règles d'alerte pour vos métriques les plus importantes. Grafana évaluera en permanence et enverra des notifications à des systèmes tels que Slack, PagerDuty, VictorOps, OpsGenie. Sources de données mixtes : mélangez différentes sources de données dans le même graphique ! Vous pouvez spécifier une source de données pour chaque requête. Cela fonctionne même pour les sources de données personnalisées.",
      "description": "Une pile d'observabilité complète qui vous permet de surveiller et d'analyser les métriques, les journaux et les traces. Elle vous permet d'interroger, de visualiser, d'alerter et de comprendre vos données, quel que soit leur emplacement de stockage."
    },
    "it": {
      "longDescription": "Grafana open source è un software open source di visualizzazione e analisi. Visualizzazioni: grafici lato client veloci e flessibili con una moltitudine di opzioni. I plugin del pannello offrono molti modi diversi per visualizzare metriche e log. Dashboard dinamiche: crea dashboard dinamiche e riutilizzabili con variabili di modello che appaiono come menu a tendina nella parte superiore della dashboard. Esplora le metriche: esplora i tuoi dati attraverso query ad hoc e drilldown dinamici. Dividi la vista e confronta diversi intervalli di tempo, query e fonti di dati affiancati. Esplora i log: prova la magia di passare dalle metriche ai log con i filtri delle etichette conservati. Cerca rapidamente tra tutti i tuoi log o riproducili in streaming dal vivo. Avvisi: definisci visivamente le regole di avviso per le tue metriche più importanti. Grafana valuterà continuamente e invierà notifiche a sistemi come Slack, PagerDuty, VictorOps, OpsGenie. Fonti di dati miste: mescola diverse fonti di dati nello stesso grafico! Puoi specificare una fonte di dati per ogni query. Questo funziona anche per le fonti di dati personalizzate.",
      "description": "A complete observability stack that allows you to monitor and analyze metrics, logs and traces. It allows you to query, visualize, alert on and understand your data no matter where it is stored."
    }
  },
  "tags": ["Network"],
  "repository": "https://github.com/grafana/grafana",
  "image": "https://hub.docker.com/r/grafana/grafana",
  "supported_architectures": [
    "amd64",
    "arm64"
  ]
}